tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/system/floor/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        floor_to_domain3
        {
            type        patch;
        }
    }
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type    zeroGradient;
                value   uniform 300;
            }

            floor_to_solid
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappa           solidThermo;
                QrNbr           none;
                Qr              none;
                kappaName       none;
                value           uniform 300;
            }

            floor_to_air
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappa           solidThermo;
                QrNbr           Qr;
                Qr              none;
                kappaName       none;
                value           uniform 300;
            }

            floor_to_domain3
            {
                type    zeroGradient;
                value   uniform 300;
            }

            minZ
            {
                type            externalWallHeatFluxTemperature;
                kappa           solidThermo;
                Ta              uniform 313.0;
                h               uniform 10e5;
                thicknessLayers (1 2);
                kappaLayers     (100 200);
                value           uniform 300.0;
                kappaName       none;
            }
        }
    }
}

// ************************************************************************* //
